cask_args appdir: "~/Applications"

# Tap
tap 'caskroom/cask'
tap 'homebrew/cask-drivers'
tap 'warrensbox/tap'
tap 'homebrew/cask-fonts'
tap 'qmk/qmk'

# Brew
brew 'stow'
brew 'neovim'
brew 'python'
brew 'python3'
brew 'git'
brew 'wget'
brew 'zsh'
brew 'curl'
brew 'tree'
brew 'jq'
brew 'fzf'
brew 'tfswitch'
brew 'node'
brew 'starship'
brew 'ripgrep'
brew 'qmk'

# Cask
cask 'slack'
cask 'iterm2'
cask 'docker'
cask 'spotify'
cask 'virtualbox'
cask 'firefox'
cask 'font-firacode-nerd-font'
cask 'font-firamono-nerd-font'
cask 'karabiner-elements'
