# Tap
tap 'homebrew/cask-fonts'
tap 'qmk/qmk'
tap 'warrensbox/tap'

# Brew
brew 'gh'
brew 'git'
brew 'go'
brew 'jq'
brew 'neovim'
brew 'node'
brew 'qmk'
brew 'ripgrep'
brew 'starship'
brew 'stow'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'zsh'
brew 'zsh-completions'

# Cask
cask 'alacritty'
cask 'caffeine'
cask 'firefox'
cask 'font-sauce-code-pro-nerd-font'
cask 'karabiner-elements'
cask 'logitech-options'
